In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
## Extract Data into DF
mta = pd.read_csv('https://data.ny.gov/api/views/xfre-bxip/rows.csv?accessType=DOWNLOAD')
cta = pd.read_csv('https://data.cityofchicago.org/api/views/6iiy-9s97/rows.csv?date=20231115&accessType=DOWNLOAD')

### Explore MTA and then clean MTA

In [3]:
mta.head()

,Month,Bus Ridership,Subway Ridership,AAR Ridership,LIRR Ridership,MNR Ridership,B&T
0,2008-01,60877526.0,130687792.0,534704.0,7078442.0,6453734.0,23956124.0
1,2008-02,57565433.0,125878662.0,508414.0,6616912.0,6144377.0,22447197.0
2,2008-03,63958459.0,137148128.0,573055.0,7149326.0,6602280.0,25164876.0
3,2008-04,63825353.0,136528969.0,584993.0,7259848.0,6787480.0,24900328.0
4,2008-05,65772096.0,140151863.0,600752.0,7306098.0,6840901.0,26172575.0

In [4]:
mta.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187 entries, 0 to 186
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             186 non-null    object
 1   Bus Ridership     186 non-null    float64
 2   Subway Ridership  186 non-null    float64
 3   AAR Ridership     185 non-null    float64
 4   LIRR Ridership    186 non-null    float64
 5   MNR Ridership     186 non-null    float64
 6   B&T               185 non-null    float64
dtypes: float64(6), object(1)
memory usage: 10.4+ KB

In [5]:
# Rename columns and drop unneeded columns
mta_cleaned = mta.rename(columns={'Month':'month', 'Bus Ridership': 'bus', 'Subway Ridership': 'metro'})
cols_to_keep = ['month', 'bus',	'metro']
mta_cleaned = mta_cleaned[cols_to_keep]

#### Check for nulls.  It so happens that the last row has nulls.

In [6]:
mta_cleaned.shape

(187, 3)

In [7]:
mta_cleaned = mta_cleaned[0:-1]

In [8]:
mta_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186 entries, 0 to 185
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   186 non-null    object
 1   bus     186 non-null    float64
 2   metro   186 non-null    float64
dtypes: float64(2), object(1)
memory usage: 4.5+ KB

In [9]:
mta_cleaned.isnull().sum()

month    0
bus      0
metro    0
dtype: int64

#### Convert MTA into the format as per the requirements.  We need a 'transportation_type' column and a 'ridership_count' column

In [10]:
mta_cleaned = pd.melt(mta_cleaned, id_vars=['month'], value_vars=['bus', 'metro'], var_name='transportation_type', value_name='ridership_count')
# Verifying that the melt has preserved both bus and metro counts in the long form of the dataframe
mask = (mta_cleaned['month'] == '2008-01')
mta_cleaned[mask]

       month transportation_type  ridership_count
0    2008-01                 bus       60877526.0
186  2008-01               metro      130687792.0

In [11]:
# Add the 'city' column as per specs:
mta_cleaned.loc[:,'city'] = 'New York'

In [12]:
mta_cleaned.head()

     month transportation_type  ridership_count      city
0  2008-01                 bus       60877526.0  New York
1  2008-02                 bus       57565433.0  New York
2  2008-03                 bus       63958459.0  New York
3  2008-04                 bus       63825353.0  New York
4  2008-05                 bus       65772096.0  New York

In [13]:
cta.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

### Exploring and cleaning CTA dataset

In [14]:
cta.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8278 entries, 0 to 8277
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   service_date    8278 non-null   object
 1   day_type        8278 non-null   object
 2   bus             8278 non-null   int64
 3   rail_boardings  8278 non-null   int64
 4   total_rides     8278 non-null   int64
dtypes: int64(3), object(2)
memory usage: 323.5+ KB

In [15]:
# Rename columns and drop unneeded columns
cta_cleaned = cta.rename(columns={'service_date':'month', 'rail_boardings': 'metro'})
cols_to_keep = ['month', 'bus',	'metro']
cta_cleaned = cta_cleaned[cols_to_keep]
cta_cleaned.head()

        month     bus   metro
0  01/01/2001  297192  126455
1  01/02/2001  780827  501952
2  01/03/2001  824923  536432
3  01/04/2001  870021  550011
4  01/05/2001  890426  557917

#### Grouping date column by month, instead of by day

In [16]:
cta_cleaned['month'] = pd.to_datetime(cta_cleaned['month'])
cta_grouped = cta_cleaned.groupby(cta_cleaned['month'].dt.month).agg(month=('month', 'first'), bus=('bus', 'sum'), metro=('metro', 'sum'))

In [17]:
cta_grouped.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, 1 to 12
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   12 non-null     datetime64[ns]
 1   bus     12 non-null     int64
 2   metro   12 non-null     int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 336.0 bytes

In [18]:
cta_grouped.head()

           month        bus      metro
month
1     2001-01-01  482184842  338409966
2     2001-02-01  476022193  330319412
3     2001-03-01  526685316  364301399
4     2001-04-01  500510416  353497405
5     2001-05-01  523538694  364730219

In [19]:
cta_grouped.isnull().sum()

month    0
bus      0
metro    0
dtype: int64

#### Convert CTA dataset into the format as per the requirements.  We need a 'transportation_type' column and a 'ridership_count' column

In [20]:
cta_grouped = pd.melt(cta_grouped, id_vars=['month'], value_vars=['bus', 'metro'], var_name='transportation_type', value_name='ridership_count')
# Verifying that the melt has preserved both bus and metro counts in the long form of the dataframe
mask = (cta_grouped['month'] == '2001-01-01')
cta_grouped[mask]

        month transportation_type  ridership_count
0  2001-01-01                 bus        482184842
12 2001-01-01               metro        338409966

In [21]:
# Add the 'city' column as per specs:
cta_grouped.loc[:,'city'] = 'Chicago'

In [22]:
cta_grouped.head()

       month transportation_type  ridership_count     city
0 2001-01-01                 bus        482184842  Chicago
1 2001-02-01                 bus        476022193  Chicago
2 2001-03-01                 bus        526685316  Chicago
3 2001-04-01                 bus        500510416  Chicago
4 2001-05-01                 bus        523538694  Chicago

### Connecting to SQL server and loading tables in

In [46]:
engine = create_engine('postgresql+psycopg2://postgres:hellosql@127.0.0.1/Public Transit')

In [31]:
cta_grouped.to_sql('cta_table', engine, if_exists='replace', index=False)
mta_cleaned.to_sql('mta_table', engine, if_exists='replace', index=False)

372

In [52]:
metro_monthly_totals = pd.read_sql_table('metro_monthly_totals', engine)

### Loading newly created SQL tables back in

In [55]:
metro_monthly_totals['city'].value_counts()

city
New York    186
Chicago      24
Name: count, dtype: int64

In [57]:
bus_monthly_totals = pd.read_sql_table('bus_monthly_totals', engine)
bus_monthly_totals['city'].value_counts()

city
New York    744
Chicago      12
Name: count, dtype: int64